# SATExportOptions Class

---
The export options used by exporting SAT format file. So far, there is no option in it.
SystemObject Autodesk.Revit.DBSATExportOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SATExportOptions : IDisposable

    Public Class SATExportOptions
    	Implements IDisposable

    public ref class SATExportOptions : IDisposable

    type SATExportOptions =
        class
            interface IDisposable
        end
The SATExportOptions type exposes the following members.
| Name| Description
---|---|---
| SATExportOptions|  Constructs a new instance of SATImportOptions with default values of all properties.
| SATExportOptions(SATExportOptions)|  Constructs a new instance of SATImportOptions as a copy of the export options.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SATExportOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace